Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/УБТ_ЧатыTelegram/УБТ_ЧатыTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБТ_ЧатыTelegram</name>
  <owners>Catalog.УБТ_БотыTelegram</owners>
  <attributes>
    <name>ИмяКонтакта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЧата</name>
    <type>
      <types>EnumRef.УБТ_ТипыЧатовTelegram</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/InformationRegisters/УБТ_КомандыБотовTelegram/УБТ_КомандыБотовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБТ_КомандыБотовTelegram</name>
  <resources>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.УБТ_СценарииБотовTelegram</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Бот</name>
    <type>
      <types>CatalogRef.УБТ_БотыTelegram</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Чат</name>
    <type>
      <types>CatalogRef.УБТ_ЧатыTelegram</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/Catalogs/УБТ_ЧатыTelegram/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнициализироватьКомандыЧата();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьКомандыЧата();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ИнициализироватьКомандыЧата();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомандыБотов

&НаКлиенте
Процедура КомандыБотовПриИзменении(Элемент)

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьКоманды(Команда)

	Если Модифицированность Тогда
		ТекстСообщения = НСтр(
			"az = 'Dəyişiklikləri əvvəlcədən qeyd edin.';en = 'Save the changes first.';ru = 'Предварительно сохраните изменения.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если УстановитьКомандыЧата() Тогда
		ТекстОповещения = НСтр(
			"az = 'Komandalar uğurla quruşdurulub';en = 'Commands have been successfully set';ru = 'Команды успешно установлены'");
		ПоказатьОповещениеПользователя(ТекстОповещения, , , БиблиотекаКартинок.Успешно32);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКоманды(Команда)

	Если Модифицированность Тогда
		ТекстСообщения = НСтр(
			"az = 'Dəyişiklikləri əvvəlcədən qeyd edin.';en = 'Save the changes first.';ru = 'Предварительно сохраните изменения.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если УдалитьКомандыЧата() Тогда
		ТекстОповещения = НСтр(
			"az = 'Komandalar silinib';en = 'Commands have been deleted';ru = 'Команды удалены'");
		ПоказатьОповещениеПользователя(ТекстОповещения, , , БиблиотекаКартинок.Успешно32);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановитьКомандыЧата()

	Возврат УБТ_РаботаСБотамиTelegram.УстановитьПерсональныеКомандыЧата(Объект.Владелец, Объект.Ссылка);

КонецФункции

&НаСервере
Функция УдалитьКомандыЧата()

	Возврат УБТ_РаботаСБотамиTelegram.УдалитьПерсональныеКомандыЧата(Объект.Владелец, Объект.Ссылка);

КонецФункции

&НаСервере
Процедура ИнициализироватьКомандыЧата()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Элементы.СтраницаПерсональныеКоманды.Видимость = Ложь;

	Иначе

		Элементы.СтраницаПерсональныеКоманды.Видимость = Истина;

		НаборЗаписей = РегистрыСведений.УБТ_КомандыБотовTelegram.СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Бот.Значение = Объект.Владелец;
		НаборЗаписей.Отбор.Бот.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.Бот.Использование = Истина;

		НаборЗаписей.Отбор.Чат.Значение = Объект.Ссылка;
		НаборЗаписей.Отбор.Чат.ВидСравнения = ВидСравнения.Равно;
		НаборЗаписей.Отбор.Чат.Использование = Истина;

		НаборЗаписей.Прочитать();

		ЗначениеВРеквизитФормы(НаборЗаписей, "КомандыБотов");

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомандыЧата()

	НаборЗаписей = РеквизитФормыВЗначение("КомандыБотов");

	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Бот = Объект.Владелец;
		Запись.Чат = Объект.Ссылка;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
